app/views/dashboard/_dashboard_form.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = 1
---
<%= form_tag(controller: "dashboard", action: "index", method: "post") do %>
	<% current_user.courses.each do |course| %>