app/views/courses/index.html.erb

SELECT "courses".* FROM "courses" WHERE (title LIKE '%sdfads%')
---

    <p>Promote and demote have been depreciated. Check if someone is a facilitator by calling "if not current_user.courses.blank? or other means."</p>