app/views/courses/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = 1
---

<% if @course.pending.eql? false or @course.users.include?(current_user) or current_user.admin.eql? true   %>

SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = 1
---
  <div class="sections">
    <% if !@course.sections.blank? %>

SELECT "courses_users".* FROM "courses_users" WHERE "courses_users"."course_id" = 1 AND "courses_users"."user_id" = 1 LIMIT 1
---
            <td><%= user.email %></td>
            <% if @course.courses_users.find_by_user_id(current_user.id) != nil or current_user.admin.eql? true %>

SELECT "uploads".* FROM "uploads" WHERE "uploads"."course_id" = 1
---
      <tbody>
        <% @course.uploads.each do |upload| %>