app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."category" IN ('Computer Science', 'Fitness', 'Business', 'Languages', 'Cognitive Science', 'All') AND "courses"."status" IN ('Full', 'Open', 'All') AND "courses"."units" IN ('1', '2', '3', '4') ORDER BY title
SELECT "courses".* FROM "courses" ORDER BY title ASC
---
  def index
    @all = Course.all_attributes
    @attributes = @all.keys

    @attributes.each do |attribute|
      session[attribute] = @all[attribute]
    end
    @attributes.each do |attribute|
      if params[attribute] && params[attribute] != 'All'
        if attribute == :days || attribute == :units
          session[attribute] = params[attribute].keys
        else
          session[attribute] = params[attribute]
        end
      end
    end

    @courses = Course.find(:all, :order => session[:title], :conditions => {:category => session[:category], :status => session[:status],
    :units => session[:units]})

    # @courses = Course.find(:all, :order => session[:title])

    if params[:search_field]
      @courses = @courses.select {|course| course.title.downcase.include? params[:search_field].downcase}

UPDATE "users" SET "facilitator" = 't', "updated_at" = '2015-04-14 04:23:32.153358' WHERE "users"."id" = 1
---
  def promote
    current_user.update_attribute :facilitator, true

INSERT INTO "courses" ("category", "created_at", "status", "title", "units", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "Computer Science"], ["created_at", Tue, 14 Apr 2015 04:23:39 UTC +00:00], ["status", "Open"], ["title", "adfas"], ["units", "4"], ["updated_at", Tue, 14 Apr 2015 04:23:39 UTC +00:00]]
---
  def create
    # @course = Course.new(params[:course])
    current_user.courses.create(params[:course])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @course = Course.find(params[:id])