app/controllers/courses_controller.rb

SELECT "section_times".* FROM "section_times" INNER JOIN "sections" ON "section_times"."section_id" = "sections"."id" WHERE "sections"."course_id" = 1
---
  def index
    @all = Course.all_attributes
    @attributes = @all.keys
    @attributes.each {|attribute| session[attribute] = @all[attribute]}
    @attributes.each do |attribute|
      if params[attribute] && params[attribute] != 'All'
        if attribute == :units
          session[attribute] = params[attribute].keys
          params[attribute] = session[attribute]
        else
          session[attribute] = params[attribute]
        end
      end

    end

    #this does not work when you don't put in information about category, status, and units
    # @courses = Course.find(:all, :order => session[:title], :conditions => {:category => session[:category], :status => session[:status],
    # :units => session[:units]})
    @courses = Course.find(:all, :order => session[:title])
    # @courses = Course.find(:all, :order => session[:title])

    if params[:search_field]
      @courses = @courses.select {|course| course.title.downcase.include? params[:search_field].downcase}
    end
    if params[:section_time]
      params[:section_time] = Section_time.filter_section_time params[:section_time]
      @courses = @courses.select {|course| course.section_times.any? {|time| time.include_time? params[:section_time]}}

INSERT INTO "courses_users" ("course_id", "user_id") VALUES (?, ?)  [["course_id", 1], ["user_id", 1]]
---
  def create
    session[:course_params].deep_merge!(params[:course]) if params[:course]
    @course = Course.new(session[:course_params])
    @course.current_step = session[:course_step]
    if @course.valid?
      if params[:previous_button]
        @course.previous_step
      elsif @course.last_step?
        if @course.all_valid?
          @course.save
          CoursesUser.create!(:user_id => current_user.id, :course_id => @course.id) if @course.all_valid?