app/controllers/existing_courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (id NOT IN (2))
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = 1
---
	def index
	    if current_user.nil? || !(user_signed_in?)
	    	redirect_to :root, notice: 'make sure you login fool'
	    else
	    	if current_user.courses == []
	    		@courses = Course.all()
	    	else
		    	@courses = Course.where('id NOT IN (?)', current_user.courses)

SELECT "courses".* FROM "courses" WHERE "courses"."title" = 'adfas' LIMIT 1
INSERT INTO "courses_users" ("course_id", "user_id") VALUES (?, ?)  [["course_id", 1], ["user_id", 1]]
---
	def create
		params.keys.each do |key|
			if params[key] == "1"
				course = Course.find_by_title(key)
				CoursesUser.create!(user_id: current_user.id, course_id: course.id)