app/controllers/facilitator_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = 1
---
  def index
    @course = Course.find(params[:course])
    @users = User.where('id not in (?)', @course.facilitators)
    if params[:search_field]
      @users = @users.select{|user| user.email.downcase.include? params[:search_field].downcase}

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'jamescheng@berkeley.edu' LIMIT 1
---
  def create
    params.keys.each do |key|
      if key.include? "@" and params[key] == "1"
        course = Course.find(params[:course].to_i)
        user = User.find_by_email(key)