app/controllers/sections_controller.rb

  def new
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]